{
	"homepage": "https://www.grim3212.com/grim-pack",
	"promos": {
		"1.12.2-latest": "6.0.0.5",
		"1.12.2-recommended": "6.0.0.5",
		"1.12.1-latest": "5.1.3.43",
		"1.12.1-recommended": "5.1.3.43",
		"1.12-latest": "5.0.0.3",
		"1.12-recommended": "5.0.0.3",
		"1.11.2-latest": "4.0.1.20",
		"1.11.2-recommended": "4.0.1.20",
		"1.11-latest": "4.0.0.0-alpha.2",
		"1.11-recommended": "4.0.0.0-alpha.2",
		"1.10.2-latest": "3.4.17.52",
		"1.10.2-recommended": "3.4.17.52",
		"1.9-latest": "2.1.3.7",
		"1.9-recommended": "2.1.3.7",
		"1.8.9-latest": "1.0.0.3",
		"1.8.9-recommended": "1.0.0.3"
	},
	"1.8.9": {
		"1.0.0.3": "Fix a crash with Grills.",
		"1.0.0.2": "Fix a fatal crash with furniture blocks.",
		"1.0.0.1": "Few bugfixes and last changes for 1.8.9.",
		"1.0.0": "The initial release of the newly combined grims mods."
	},
	"1.9": {
		"2.1.3.7": "Fix entities that were broken, fix server side issues, lots of config changes, and fix update url.",
		"2.0.2.4": "Properly fixes item colors, adds support for Flat Colored Blocks, and fix a small world gen issue.",
		"2.0.0.2": "Fixes a problem with modern furnaces. Also fixes compatibility issues with other mods blocks in decor.",
		"2.0.0.0": "Combines all parts mods into 1 mod and combine a lot of the logic. Lots of bugfixes and changes."
	},
	"1.10.2": {
		"3.4.17.52": "Fix Infinite Lava loop",
		"3.4.17.51": "Add in Specific Sensors, GPS, more Refinery and Modern Furnace recipes, and a config option for uranium damage. Fix compatibility with refined storage and fix a problem with the cutting knife and mixer and fix machines not dropping xp.",
		"3.4.16.45": "Mo' People bug fixes, armor values being wrong. Secret",
		"3.4.16.40": "Add more world gen config options. Change mobs and desert wells to support loot tables. Add support for Just Enough Resources.",
		"3.4.15.38": "Add in Chinese translations.",
		"3.4.15.37": "Add some new functionality for portable workbenches. Add some new sounds. Fix a chunk generation crash.",
		"3.4.14.33": "Fix a crash with projectiles hitting entities. Now includes a mcmod.info file.",
		"3.4.13.32": "Fix an crash with rayguns and adjust ice pixie height.",
		"3.4.13.31": "Fixes workbench upgrades returning wrong amounts and wrong items for recipes.",
		"3.4.13.30": "Add in the ability to blacklist or whitelist recipes to be used in Workbench upgrades.",
		"3.4.13.29": "Fix some crashes with Cages. Fix milk bucket rendering. Fix bedrock and floating island generation in a void world",
		"3.4.13.24": "Allow cages to render mobs using pokeballs. Add in black diamond and steel multitools. Fix some bugs with hedge blocks and buckets.",
		"3.4.10.22": "Added in boomerangs. A previous update that I did from 1.2.5.",
		"3.4.9.22": "Small change to Flat Item Frames that makes it so it renders all 3D models flipped if flipBlocks is true.",
		"3.4.9.21": "Fix Milk Event and add in ability to flip blocks in Flat Item Frames.",
		"3.4.9.19": "Add in Flat Item Frames which can be placed on all sides of blocks.",
		"3.4.8.19": "Added in the Fan block. This is similar to the Gravity Science blocks but more configurable.",
		"3.4.7.19": "Added in the Extruder that I updated a long time ago.",
		"3.4.6.19": "Made the Ultimate Fist more configurable so you can make more or less overpowered how you see fit.",
		"3.4.6.18": "Make the Ultimate Fist enchantable for even more Overpowered-ness.",
		"3.4.6.17": "Change slope collision to be configured to be smoother. Add in debug utility for viewing blocks collision boxes.",
		"3.4.6.15": "Some fixes to MultiTools not efficient on blocks. Add in support for JEI transfer for Workbench Upgrades. Built using JEI version 3.9.0.244",
		"3.4.6.13": "Added in super slopes. Everything uses the new colorizer system and has a few extra blocks.",
		"3.4.4.13": "Big refactoring. Huge changes to Instruction manual as well as fixes to buckets and changes to camo plate.",
		"3.2.2.10": "Add a config option for multitool durability. Add a home button to the manual",
		"3.2.2.8": "A huge amount of changes. Many of these change recipes as well as a overhaul of decor furniture.",
		"3.0.0.1": "Fix a world generation crash that would sometimes happen with Biomes O' Plenty. Also change version to actually be what the update is looking for.",
		"3.0.0.0": "Fix vanilla desert wells from spawning. Add a config option for workbench upgrades. Requires Forge 12.18.1.2039."
	},
	"1.11": {
		"4.0.0.0-alpha.2": "Fix Pokeballs not working at all.",
		"4.0.0.0-alpha.1": "Fix crashes with Frames, Wallpaper, cages, and machines.",
		"4.0.0.0-alpha": "Port to 1.11. Many changes to decor, powerstaff, slingshots, fungus, and more. See full changelog at curseforge."
	},
	"1.11.2": {
		"4.0.1.19": "Fix slingshots crashing on random.",
		"4.0.1.19": "Fix boomerangs not returning to slots and overwriting items. Fix Ultimate Fist not allowing for configurable durability.",
		"4.0.1.17": "Add in Parabuzzy's and Bob-omb's. Add in a basic fluid tank. Add in more MultiTools enchantment options.",
		"4.0.1.14": "Add in MoreStorage and finish adding drill and conveyor from We(raft.",
		"4.0.0.13": "Fix conflicting achievements. This will remove achievement progress for GrimPack.",
		"4.0.0.12": "Add in achievements through all of the parts. Fix positioning for Mining Wand.",
		"4.0.0.10": "Big configuration list changes. Fix item models in hand, add in Bauble support for Graves, fix compatibility issues with multitools, fix manual links.",
		"4.0.0.4": "Fix multitools not having durability. Change Pillar's bounding box.",
		"4.0.0.2": "Fix Backpack and pellet bag recipes sometimes not working and a compatibility with other mods and my tool materials.",
		"4.0.0.0": "A bunch of stuff has changed. Slingshot changes, new blocks, more JEI support, more documentation, lots of bug fixes, and more!!!",
		"4.0.0.0-beta": "Update to 1.11.2. More changes to slingshots. Add in more OreDictionary entries and allow Modern Furnaces to accept vanilla fuel."
	},
	"1.12": {
		"5.0.0.3": "Fix portable workbench crashing.",
		"5.0.0.2": "Fix slingshot crashing on random.",
		"5.0.0.1": "Fix for OreDictionary replacing.",
		"5.0.0.0": "First update to 1.12. Small fix everywhere. All recipes should be configurable except for Backpacks and Pellet Bags."
	},
	"1.12.1": {
		"5.1.3.43": "New site https://www.grim3212.com/grim-pack. Information pulled from Instruction Manual. Fix aluminum links, emptying buckets, flatitemframe rendering, tooltips for tools, and grabbing oredict names. Recipe condition for subparts changed to check if part is loaded first.",
		"5.1.2.35": "Tameable Treasure mob, grenade launcher, shaped charges, chicken feathers, alarm box, legendary staves, fix fungus drops, and fix crash with armor and tool materials.",
		"5.1.1.27": "Fix recipe loading causing a crash and displaying missing recipes crash.",
		"5.1.1.24": "Configurable Update. Lots of changes to make GrimPack more customizable like disabling subparts, customize tool and armor material values, and new JSON recipes for Grill, Machines, and Chisels.",
		"5.1.1.22": "Configurable Update. Lots of changes to make GrimPack more customizable like disabling subparts, customize tool and armor material values, and new JSON recipes for Grill, Machines, and Chisels.",
	},
	"1.12.2": {
		"6.0.0.5": "Cheese makers take less time. Fix knife recipe. Fix occasional Desert Well crash. Change some wands to check durability before they run.",
		"6.0.0.1": "Fix JEI and JER integrations. Remove use of deprecated methods. Change TileEntity Registration. This will break a lot of TileEntities, mostly in Grim Industry. WIP Magic Wand Stuff",
		"6.0.0.0": "Fix JEI and JER integrations. Remove use of deprecated methods. Change TileEntity Registration. This will break a lot of TileEntities, mostly in Grim Industry. WIP Magic Wand Stuff",
		"5.2.12.78": "Add in config option for partial bucket amounts.",
		"5.2.12.77": "Fix bucket filling and draining non bucket amounts. Fix breaking buckets when draining. Attempt to fix Pokeball's not dropping and backpacks crashing.",
		"5.2.12.73": "Add in a basic chunk loader. Add in information to crash reports to easily tell what is enabled/disabled. Fix mcmod.info url. Fix crash on ruin page if fungus was disabled.",
		"5.2.11.68": "Fix crash on servers with Gravity and Directional Gravity blocks",
		"5.2.11.67": "Change cheese block model (stohun01)",
		"5.2.11.66": "Change conveyor belts to be their own subpart as intended.",
		"5.2.11.65": "Fix milk buckets being able to be filled with fluids other than milk.",
		"5.2.11.64": "Fix RWays staying around and fix crash that would occur with graves and shaders. Update local Forge version.",
		"5.2.11.62": "Add in Rune Info page, Add in Cage Info about Pokeballs. Fix crash with Freezing an entity and arrow sensors. Update local Forge version.",
		"5.2.11.57": "Add in Chicken Suit, Fluro Tubes, Structures, Detonators, and Bridges. Fix cascading chunk errors. Fix Pruner crash. Fix lists in PageItemStack. Fix Grave text. Log start time to console. Fix server crash with detonators. Change corner uv to look better.",
		"5.2.11.55": "Add in Chicken Suit, Fluro Tubes, Structures, Detonators, and Bridges. Fix cascading chunk errors. Fix Pruner crash. Fix lists in PageItemStack. Fix Grave text. Log start time to console.",
		"5.2.6.45": "Update to 1.12.2. Add in autotorch, flip flop and glowstone torches, and Neon Signs.",
	},
}