{
	"homepage": "http://mods.grim3212.com/grim-pack/",
	"promos": {
		"1.10.2-latest": "3.4.9.19",
		"1.10.2-recommended": "3.4.9.19",
		"1.9-latest": "2.1.3.7",
		"1.9-recommended": "2.1.3.7",
		"1.8.9-latest": "1.0.0.1",
		"1.8.9-recommended": "1.0.0.1"
	},
	"1.8.9": {
		"1.0.0.1": "Few bugfixes and last changes for 1.8.9.",
		"1.0.0": "The initial release of the newly combined grims mods."
	},
	"1.9": {
		"2.1.3.7": "Fix entities that were broken, fix server side issues, lots of config changes, and fix update url.",
		"2.0.2.4": "Properly fixes item colors, adds support for Flat Colored Blocks, and fix a small world gen issue.",
		"2.0.0.2": "Fixes a problem with modern furnaces. Also fixes compatibility issues with other mods blocks in decor.",
		"2.0.0.0": "Combines all parts mods into 1 mod and combine a lot of the logic. Lots of bugfixes and changes."
	},
	"1.10.2": {
		"3.4.9.19": "Add in Flat Item Frames which can be placed on all sides of blocks.",
		"3.4.8.19": "Added in the Fan block. This is similar to the Gravity Science blocks but more configurable.",
		"3.4.7.19": "Added in the Extruder that I updated a long time ago.",
		"3.4.6.19": "Made the Ultimate Fist more configurable so you can make more or less overpowered how you see fit.",
		"3.4.6.18": "Make the Ultimate Fist enchantable for even more Overpowered-ness.",
		"3.4.6.17": "Change slope collision to be configured to be smoother. Add in debug utility for viewing blocks collision boxes.",
		"3.4.6.15": "Some fixes to MultiTools not efficient on blocks. Add in support for JEI transfer for Workbench Upgrades. Built using JEI version 3.9.0.244",
		"3.4.6.13": "Added in super slopes. Everything uses the new colorizer system and has a few extra blocks.",
		"3.4.4.13": "Big refactoring. Huge changes to Instruction manual as well as fixes to buckets and changes to camo plate.",
		"3.2.2.10": "Add a config option for multitool durability. Add a home button to the manual",
		"3.2.2.8": "A huge amount of changes. Many of these change recipes as well as a overhaul of decor furniture.",
		"3.0.0.1": "Fix a world generation crash that would sometimes happen with Biomes O' Plenty. Also change version to actually be what the update is looking for.",
		"3.0.0.0": "Fix vanilla desert wells from spawning. Add a config option for workbench upgrades. Requires Forge 12.18.1.2039."
	}
}